/**
 * * commit --amend (amend -  в  пр. "изменить")
 * @format
 */

/**
 * * Например. Мы сделали коммит и создали еще один файл и захотели внести его в этот коммит
 * ! git commit --amend
 */

/**
 * * Если мы хотим поменять только сообщение коммита, например, опечатались
 * ! git commit --amend -m "new message"
 */

/**
 * * Если нужно подклеить изменение к коммиту, но не нужно менять сообщение
 * ! git commit --amend --no-edit
 */

/**
 * * Например. Закоммитили под другим автором
 * ! git commit --amend --author="new author"
 */
